
#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение(ТекстСообщения) Экспорт

    Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); 
    ЧатИД = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

    АдресСервера = "api.telegram.org";
    Ресурс = "/bot" + Токен + "/sendMessage";
	
	СтруктураИД = Новый Структура;
   	СтруктураИД.Вставить("chat_id", ЧатИД);
    СтруктураИД.Вставить("text", ТекстСообщения); 
    	
    JSONСтрока = ЗаписатьЗначениеJSON(СтруктураИД);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");

    Попытка

        Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL); 
		
		Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
        
        Запрос.УстановитьТелоИзСтроки(JSONСтрока);

        Ответ = Соединение.ОтправитьДляОбработки(Запрос);

        Если Ответ.КодСостояния <> 200 Тогда
            СообщениеОбОшибке = "Ошибка при отправке сообщения в Телеграм. Код: " 
                + Строка(Ответ.КодСостояния) + Символы.ПС 
                + Ответ.ПолучитьТелоКакСтроку();
            ЗаписьЖурналаРегистрации(НСтр("ru='Телеграм'"), УровеньЖурналаРегистрации.Ошибка, , СообщениеОбОшибке);
        КонецЕсли;

    Исключение
        СообщениеОбОшибке = "Не удалось отправить сообщение в Телеграм: " + ОписаниеОшибки();
        ЗаписьЖурналаРегистрации(НСтр("ru='Телеграм'"), УровеньЖурналаРегистрации.Ошибка, , СообщениеОбОшибке);
    КонецПопытки;

КонецПроцедуры


Процедура ОтправкаСообщений() Экспорт
	
	Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтправитьСообщение(Выборка.ТекстСообщения);
		ОбъектСообщение = Выборка.ПолучитьОбъект();
		ОбъектСообщение.Удалить();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
