
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;	
	
	Для Каждого ТекСтрокаНачисления из Выплаты Цикл

		// регистр ВКМ_ВзаиморасчетыССотрудниками
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Сумма = ТекСтрокаНачисления.Сумма;
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Регистратор = Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли