#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(ДиаграммаГанта, Параметры.Адрес, Параметры.Дата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПриОткрытииНаСервере(Диаграмма, Адрес, Дата)

	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Адрес);

	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();

	Для Каждого Отпуск Из ТаблицаОтпусков Цикл

		Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
		Диаграмма.УстановитьПолныйИнтервал(НачалоГода(Дата), КонецГода(Дата));

		ТекущаяСерия = Диаграмма.УстановитьСерию("Отпуск");
		ТекущаяСерия.Текст = "Отпуск";
		ТекущаяТочка = Диаграмма.УстановитьТочку(Отпуск.Сотрудник);
		ТекущаяТочка.Текст = Отпуск.Сотрудник;
		ТекущееЗначение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);

		ТекущийИнтервал = ТекущееЗначение.Добавить();
		ТекущийИнтервал.Начало = Отпуск.ДатаНачала;
		ТекущийИнтервал.Конец = Отпуск.ДатаОкончания;

	КонецЦикла;

	Диаграмма.Обновление = Истина;

КонецПроцедуры

#КонецОбласти