
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаПериодДоговора = Элементы.Добавить("ГруппаПериодДоговора", Тип("ГруппаФормы")); 
	ГруппаПериодДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаПериодДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаПериодДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементВКМ_ДатаНачалаДействияДоговора = Элементы.Добавить("ЭлементВКМ_ДатаНачалаДействияДоговора",Тип("ПолеФормы"),Элементы.ГруппаПериодДоговора); 
	ЭлементВКМ_ДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ЭлементВКМ_ДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода; 
		
	ЭлементВКМ_ДатаОкончанияДействияДоговора = Элементы.Добавить("ЭлементВКМ_ДатаОкончанияДействияДоговора",Тип("ПолеФормы"),Элементы.ГруппаПериодДоговора); 
	ЭлементВКМ_ДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ЭлементВКМ_ДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода; 
		
	ГруппаСтоимость = Элементы.Добавить("ГруппаСтоимость", Тип("ГруппаФормы")); 
	ГруппаСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаСтоимость.ОтображатьЗаголовок = Ложь;
	ГруппаСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
	ЭлементВКМ_СуммаАбонентскойПлаты = Элементы.Добавить("ЭлементВКМ_СуммаАбонентскойПлаты",Тип("ПолеФормы"),Элементы.ГруппаСтоимость); 
	ЭлементВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода; 
	
	ЭлементВКМ_СтоимостьЧасаРаботы = Элементы.Добавить("ЭлементВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"),Элементы.ГруппаСтоимость); 
	ЭлементВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ЭлементВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитов();
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьРеквизитов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПериодДоговора", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтоимость", "Видимость", Истина);	
		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПериодДоговора", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтоимость", "Видимость", Ложь);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
