#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьАкты(Команда)

	СоздатьАкты = СоздатьАктыНаСервере(Объект.Период, УникальныйИдентификатор);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);

	ДлительныеОперацииКлиент.ОжидатьЗавершение(СоздатьАкты, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция СоздатьАктыНаСервере(Период, УникальныйИдентификатор)

	СоздатьАкты = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьАктыНаСервере", Период);

	Возврат СоздатьАкты;

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда

		МассивДоговоров = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого Элемент Из МассивДоговоров Цикл
			
		НоваяСтрока = Объект.СписокДоговоров.Добавить();	
		НоваяСтрока.Договор = Элемент.Договор;	
		НоваяСтрока.РеализацияТоваровУслуг = Элемент.РеализацияТоваровУслуг;	
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры    

#КонецОбласти
